export const questions = [
  {
    question: 'Билиотекой какого языка программирования является React?',
    options: ['C#', 'PHP', 'JavaScript', 'ReactScript'],
    rightAnswer: 3,
  },
  {
    question: 'Идемпотентность - это...',
    options: ['Одна из парадигм программирования', 'Свойство объекта или операции, при повторном приминении давать тот же результат, что и при первом', 'Принцип программирования, согласно которому для каждого класса должно быть одно единственное назначение', 'размещение в одном компоненте данных и методов, которые с ними работают'],
    rightAnswer: 2,
  },
  {
    question: 'Какого метода HTTP запроса не существует?',
    options: ['option', 'trace', 'create', 'post'],
    rightAnswer: 3,
  },
  {
    question:
      'Какой протокол передачи данных самый современный на данный момент?',
    options: ['XML', 'WebSocket', 'HTTP', 'HTTPS'],
    rightAnswer: 2,
  },
  {
    question: 'Что такое условный оператор?',
    options: [
      'Оператор сравнения значений',
      'Конструкция, что выполняет код несколько раз',
      'Конструкция для создания определенной переменной',
      'Метод объявления функции',
    ],
    rightAnswer: 1,
  },
];

